Aula 1: Fazendo a leitura de arquivso CSV

In [ ]:
# Lendo arquivos CSV

import pandas as pd

url = 'https://raw.githubusercontent.com/alura-cursos/pandas/main/superstore_data.csv' #carrega a url com os dados que vamos usar
dados_mercado = pd.read_csv(url, sep=',') # le o arquivo CSV e salva eles na varivel, sep = ',' diz que o arquivo tem os dados separados por ,

In [ ]:
dados_mercado.head() #.head() mostar as 5 primeiras linhas do DF

In [ ]:
url_2 = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/superstore_data_ponto_virgula.csv'

dados_ponto_virgula = pd.read_csv(url_2, sep= ';') # sep diz que os dados são separados por ';', se não colocar o sep=';' o arquivos nãob é lido corretamente, sempre prestar atenção no arquivo bruto pra ver como os dados são separados 
dados_ponto_virgula.head()

Como detectar o encoding de um arquivo CSV

import chardet

with open('/content/dados.csv', 'rb') as file:
    print(chardet.detect(file.read()))


'''
Note que a primeira linha deste código abre o arquivo CSV em modo de leitura binária rb e atribui o objeto de arquivo retornado a uma variável chamada file

Na segunda linha do código, o conteúdo do arquivo CSV é lido usando o método read() e o resultado é passado para a função chardet.detect(), que retorna um dicionário contendo informações sobre a codificação mais provável do arquivo. O resultado é impresso com a função print() que mostra a codificação e a confiança associada a essa codificação.

Ao executar o código Giovanna obteve o seguinte resultado:

{'encoding': 'ISO-8859-1', 'confidence': 0.73, 'language': ''}

Agora ela sabe que o arquivo CSV provavelmente possui a codificação ISO-8859-1 com uma confiança de 0.73. Para especificar a codificação correta ao carregar o arquivo CSV com a biblioteca Pandas, é possível usar um parâmetro chamado encoding:

df = pd.read_csv('/content/dados.csv', encoding='ISO-8859-1')

Desta forma, a biblioteca Pandas irá carregar o arquivo CSV usando a codificação ISO-8859-1, o que vai resolver o erro de encoding. Então, se algum dia você tentar ler um arquivo e surgir esse mesmo erro, lembre-se dessa dica!
'''

In [ ]:
# Parâmetros da função read_csv

dados_primeiras_linhas = pd.read_csv(url, nrows = 5) # nrows = x pega só as x primeiras linhas do DF, não pegadno todo o DF, isso serva para uma simples vizualização do DF, sem ter que acrregar ele todo
dados_primeiras_linhas

In [ ]:
dados_selecao = pd.read_csv(url, usecols = ['Id', 'Year_Birth', 'Income']) # usecols = ['x','y','z'], pega só colunas expecificas do DF, no exemplo ele só pegas as colunas com nome x, y, z, as colunas tambem poder ser chamadas por idexação exemplo usecols = [0, 1, 4]), mopstra as mesmas colunas chamada por nome acima só que agora por indexação
dados_selecao

In [ ]:
# escervendo arquivos CSV

dados_selecao.to_csv('clientes_mercado.csv', index = False) # to_csv('nome') salva uma arquivo na maquina com o nome passado no parenteses, index=False esse parametro serve par que quando for salvar um arquivo não seja adicionado uma coluna nova de index

In [ ]:
clientes_mercado = pd.read_csv('clientes_mercado.csv') # vizualização pra te certeza se foi salvo corretamente
clientes_mercado

Aula 2: Utilizando planilhas

In [ ]:
# Lendo arquivos Exel

url_3 = 'https://github.com/alura-cursos/Pandas/blob/main/emissoes_CO2.xlsx?raw=True'
# raw = True significa que está trazendo os dados brutos 

dados_co2 = pd.read_excel(url_3) # .pd.read_excel(nome) le arquivos xlsx

dados_co2.head()

In [ ]:
pd.ExcelFile(url_3).sheet_names # .ExelFile() diz que é um arqivo excel, .sheet_names vé se não tem outras paginas (paginas são outras planilhas) dentro do arquivo excel

read_excel pode ler os seguintes tipos de arquivo, xls, xlsm, xlsb, odf, ods e odt.

In [ ]:
# Parametros da função read_excel

percapita = pd.read_excel(url_3, sheet_name='emissoes_percapita') # sheet_name = 'emissoes_percapita' le a pagina e salva ela em percapita

In [ ]:
percapita.head()

In [ ]:
fontes = pd.read_excel(url_3, sheet_name='fontes') # carrega a terceira pagina

In [ ]:
fontes.head()

In [ ]:
intervalo = pd.read_excel(url_3, sheet_name= 'emissoes_C02', usecols= 'A:D') # usecols serve para selecionar colunas expecificas da planilha, no exemplo acima está selecionando da coluna A até a coluna D

In [ ]:
intervalo

In [ ]:
intervalo_2 = pd.read_excel(url_3, sheet_name= 'emissoes_C02', usecols= 'A:D', nrows= 10) 
# nrows = x retorna as x primieras linhas

In [ ]:
intervalo_2

In [ ]:
# Escrevendo (salvando) arquivos Excel

percapita.to_excel('Percapita_CO2.xlsx', index=False) # to_excel salva o arquivo percapita na pasta em que o codigo está e nome que o arquivo recebe é o nome que passa entre aspas, index=False é para não salvar com o index

In [ ]:
pd.read_excel('Percapita_CO2.xlsx')

In [ ]:
# Lendo dados do Google Planilhas 

'''https://docs.google.com/spreadsheets/d/1Z6crkywaULV1p33NKy2a_rGgQ_D9h7dpdCsPjv3NXZo/edit?usp=sharing  # o ID da planilha começa depois do 'd/' e vai até o 'o' no case : '1Z6crkywaULV1p33NKy2a_rGgQ_D9h7dpdCsPjv3NXZo'''

In [ ]:
sheet_id = '1Z6crkywaULV1p33NKy2a_rGgQ_D9h7dpdCsPjv3NXZo' # id da planilha, o id é tudo o que aparece entre 'd/' e '/edit'.

In [ ]:
url_4 = f'https://docs.google.com/spreadsheets/d/{sheet_id}/gviz/tq?tqx=out:csv&sheet' # pra não ficar tão grande a linha e facilitar o vizualização pode apagar a parte do link do final até o 'd/', coloca o link dentro de uma f string e no final passa a variavel que contem o ID da planilha, /gviz/tq indica que você deseja acessar o recurso de consulta de dados da API de visualização de dados, ?tqx=out:csv para que os dados sejam retornados no formato CSV, &sheet esse comando faz que todos os dados sejam retornados (cabeçaljo, linhas, colunas, etc)

In [ ]:
dados_co2_sheets =  pd.read_csv(url_4)

In [ ]:
dados_co2_sheets.head()

In [ ]:
sheet_id = '1Z6crkywaULV1p33NKy2a_rGgQ_D9h7dpdCsPjv3NXZo'
sheet_name = 'emissoes_percapita'
url_percapita = f'https://docs.google.com/spreadsheets/d/{sheet_id}/gviz/tq?tqx=out:csv&sheet={sheet_name}' # isso tudo é pra carregar a segunda pagina da planilha

In [ ]:
percapita_sheets = pd.read_csv(url_percapita)
percapita_sheets.head()

In [ ]:
sheet_id = '1Z6crkywaULV1p33NKy2a_rGgQ_D9h7dpdCsPjv3NXZo'
sheet_name = 'fontes'
url_fontes = f'https://docs.google.com/spreadsheets/d/{sheet_id}/gviz/tq?tqx=out:csv&sheet={sheet_name}' # isso tudo é pra carregar a terceira tabela da planilha

In [ ]:
fontes_sheets = pd.read_csv(url_fontes)
fontes_sheets.head()

Aula 3: Manipulando arquivos JSON

In [ ]:
# Lendo arquivos JSON

'''
um arquivo JSON é como se fosse um dicionario em python, contendo chaves e valores, cada chave tem seu valor ex:

{"ID":"01", "Faixa_etaria":"55-59", "Sexo_biologico":"Feminino"}
'''

import pandas as pd 

url_5 = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/pacientes.json'
dados_pacientes = pd.read_json(url_5)

dados_pacientes

In [ ]:
# nem sempre é facil carregar um arquivo JSON porque as vezes as informações podems estra aninhadas como as do exemplo abaixo: onde os dados ficam mal organizados prara a vizualização, pois elas estão aninhadas ou sejas os dados estão todos juntos sem separação das colunas e linhas

url_6 = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/pacientes_2.json'
dados_pacientes_2 = pd.read_json(url_6)
dados_pacientes_2

In [ ]:
# normalizadno arquivos JSON

# usando o site jsoncrack voce pode vizualizar o arquivo jsaon que esta aninhado de uma forma compreensivel

df_normalizado = pd.json_normalize(dados_pacientes_2['Pacientes']) # .json_normalize(variavel que contem o arquivo['qual a coluna que vc quer normalizar']), a coluna escolhida foi ecolhida por que os dados estão aninhados nela

In [ ]:
df_normalizado

In [ ]:
# record_path Esse parâmetro é usado na função pd.json_normalize() para especificar o caminho para os registros que devem ser normalizados em um DataFrame separado, meta O resultado parece ótimo, mas não inclui as colunas “Pesquisa” e “Ano”. Para incluí-las, podemos usar o parâmetro meta para especificar outras colunas que queremos no DataFrame.

Importante: Na aula nós realizamos a normalização em um arquivo com o formato JSON. No entanto, a função json_normalize() aceita apenas um dicionário ou uma lista de dicionários. Por isso, no vídeo foi usada a estratégia de usar o código: pd.json_normalize(dados_pacientes_2['Pacientes']). Porém, se tentarmos usar parâmetros da função json_normalize em um arquivo JSON podem surgir erros. Para contornar isso, precisamos importar o módulo json e ler os arquivos conforme o código abaixo:

In [ ]:
#Importando a biblioteca Pandas
import pandas as pd

#Importando o módulo JSON
import json

#Lendo o arquivo json usando o módulo Python JSON
with open('pacientes_2.json','r') as f:
    dados = json.loads(f.read())

#Normalizando os dados com os parâmetros record_path e meta
pd.json_normalize(dados, record_path='Pacientes', meta=['Pesquisa', 'Ano'])

# record_path Esse parâmetro é usado na função pd.json_normalize() para especificar o caminho para os registros que devem ser normalizados em um DataFrame separado, meta O resultado parece ótimo, mas não inclui as colunas “Pesquisa” e “Ano”. Para incluí-las, podemos usar o parâmetro meta para especificar outras colunas que queremos no DataFrame.

In [ ]:
# escrevendo arquivos JSON

df_normalizado.to_json('historico_pacientes_normalizado.json')

In [ ]:
pd.read_json('historico_pacientes_normalizado.json') # pode ser salvo em oputros formatos como csv ou exel

Aula 4: Lendo dados em HTML e XML

In [ ]:
# Lendo paginas Web

# arquivo com os 100 melhores melhores filmes do cinema

'''
em HTML as tabelas que estão no site geralmente tem uma tab 'table' nelas no codigo do site

inspecionando o codigo do site apertando ctrl,+,f vai abrir uma barra de pesquisa ai coloca <table> que vai mostrar as tabelas do site 
'''

In [ ]:
import pandas as pd

dados_html = pd.read_html('filmes_wikipedia.html') # quando usamos pd.read_html ele pega todas tabelas que existem no site e transforma cada uma em um DF e retorna todos os DFs dentro de uma lista, no caso  lista tem, 3 DFs 

dados_html

In [ ]:
type(dados_html) # retorna que o tipo é uma lista pois os DFs estão salvos dentro de uma lista

In [ ]:
len(dados_html) # o resultado vai ser 3 posi temos 3 DFs dentro das listas

In [ ]:
top_filmes = dados_html[1] # para podermos vizualizar o DF temos que selecionar ele na lista, com o DF que queremos ver é o segundo na lista e python começa com index 0 passamos o valor 1 e salvamos o DF na variavel top_filmes

top_filmes

In [ ]:
# escrevendo arquivos HTML (salvando)

top_filmes.to_html('top_filmes.html') # salva o DF no fromato HTML, podemos salvar esses dados em outros formatos só mudando o 'to_html' para 'to_csv' ou outro formato

In [ ]:
# lendo/escrevendo arquivos XML

# XML (Extensible Markup Language, Linguagem de marcação extensivel)

import pandas as pd 

dados_imdb = pd.read_xml('imdb_top_1000.xml')

dados_imdb.head(2)

In [ ]:
dados_imdb.to_xml('Filmes_imdb.xml')

Aula 5: Trabalhando com banco de dados

In [22]:
# Criando um banco de dados local

import pandas as pd
import sqlalchemy

from sqlalchemy import create_engine, MetaData, Table, inspect # essa importação que faz aligação com o banco de dados, oque faz ele funcionar,create_engine cira a coneção com o banco de dados, a classe metaData ela representa as informações do banco de dados como as colunas, linhas, dados etc, a classe Table representa uma tabela em um banco de dados usada pra criar e manipular dados em uma tabela especifica, a função inspect permite inspecionar a estrututa do banco de dados como tabelas e colunas

In [23]:
engine = create_engine('sqlite:///:memory:') # aqui voce está criando o banco de dados, create_engine cria o banco de dados, 'sqlite' especifica qual o Banco de dados que vai ser utilizado, 'memory' quer dizer que está usando um banco de dados local que está na memoria local, (é a URL de conexão, indicando que o banco de dados está em memória.)

In [24]:
# escrevendo em um banco de dados 

url= 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/clientes_banco.csv'

dados_sql = pd.read_csv(url)

dados_sql.head()

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
2,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio
3,5008808,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio
4,5008809,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio

In [25]:
dados_sql.to_sql('Clientes', engine, index= False) # to)_sql converte e salva os dados em sql, dentro da engine que vc passar (onde está o banco de dados)

438463

In [1]:
inspector = inspect(engine) # unsao a função inspect e passando o motor do banco de dados voce vai poder expecionar o banco de dados

NameError: name 'inspect' is not defined

In [27]:
print(inspector.get_table_names()) # get_table_nomes retorna o nome das tabelas que tem no banco de dados

['Clientes']

Alguns comandos em SQL

SELECT: especifica quais colunas devem ser selecionadas na consulta.

FROM: especifica as tabelas do banco de dados que devem ser consultadas.

WHERE: filtra os resultados da consulta com base em uma ou mais condições especificadas.

ORDER BY: classifica os resultados da consulta em ordem crescente ou decrescente com base em uma 
ou mais colunas.

GROUP BY: agrupa os resultados da consulta com base em uma ou mais colunas.

LIMIT: limita o número de linhas retornadas pelos resultados da consulta.

*: significa todos os dados

In [28]:
# Lendo uma consulta SQL
# aqui vamos aprender a usar comando SQL pelo python

# geralmente quando vamos passar um comando em SQL usamos a variavel de nome query, não é uma lei nem origação mas deixa o codigo mais claro

query = 'SELECT * FROM Clientes WHERE Categoria_de_renda="Empregado"' # dentro das aspas está o comadno em SQL, vamos separar a renda somente das pesoas que estão trablhando, o comadno pega da tabela CLientes na coluna Categoria_de_renda onde só quem tiver a informação 'empregado' salva

In [29]:
empregados = pd.read_sql(query, engine) # para executar o comando que foi passado na variavel query precisamos usar o read_sql e passamos o comadno que vai ser realizado e qual banco de dados ele vai ser reaçizado, no caso vamos usar o comadno no banco de dados engine 

empregados.head()

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
2,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio
3,5008815,46,Ensino superior,Casado,2,Empregado,Contabilidade,2,270000.0,1,Casa/apartamento próprio
4,5112956,46,Ensino superior,Casado,2,Empregado,Contabilidade,2,270000.0,1,Casa/apartamento próprio

In [30]:
empregados.to_sql('empregados',con=engine, index=False) # salvamsoa tebela dentro do nosso banco de dados engine

226059

In [31]:
pd.read_sql_table('empregados', engine).head() # aqui fazemos a leitura de uma tabela especifica do nosso banco de dados, usamos pd.read_sql_table e passamos o nome da tabela entre aspas e o banco de dados que essa tabela se encontra

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
2,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio
3,5008815,46,Ensino superior,Casado,2,Empregado,Contabilidade,2,270000.0,1,Casa/apartamento próprio
4,5112956,46,Ensino superior,Casado,2,Empregado,Contabilidade,2,270000.0,1,Casa/apartamento próprio

read_sql é pra ler uma consulta no BD

read_sql_table é pr ler uma tabela no BD

In [32]:
pd.read_sql_table('empregados', engine, columns=['ID_Cliente', 'Grau_escolaridade', 'Rendimento_anual']).head() # aqui usando columns podemos selecionar só as colunas que queremos vizualizar

   ID_Cliente Grau_escolaridade  Rendimento_anual
0     5008804   Ensino superior          427500.0
1     5008805   Ensino superior          427500.0
2     5008806      Ensino médio          112500.0
3     5008815   Ensino superior          270000.0
4     5112956   Ensino superior          270000.0

In [41]:
# Atualizando um Banco de Dados

query = 'SELECT * FROM Clientes'

pd.read_sql(query, engine).head()

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
2,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio
3,5008808,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio
4,5008809,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio

In [57]:
# deletadno uma informação do banco de dados

from sqlalchemy import text # importa a função text da bibliteca sqlalchemy

query = text('DELETE FROM Clientes WHERE ID_Cliente=5008804') # o comando passado deleta a linha onde na coluna ID_Cliente for igual a 5008804, a função text cria um objeto de instrução sql, caso não use ele o conn.execute(query) não aceita a variavel query como um comando lendo ela como uma simples str e dando erro 
with engine.connect() as conn: # with serve para garantir que a coneção do banco de dados seja fechada corretamente após a consulta, connect() estabelece uma coneção com o banco de dados, conn é o apeldido para essa coneção
    conn.execute(query) # execute() serve para executar o comando que foi passado dentro dos parenteses diretamente no banco de dados
    conn.commit() # commit garante que a operação de exclusão seja aplicad no banco de dados

In [58]:
pd.read_sql_table('Clientes', engine).head()

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio
2,5008808,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio
3,5008809,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio
4,5008810,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio

In [64]:
# Atualizando uma informação no Banco de dados

query = text('UPDATE Clientes SET Grau_escolaridade="Ensino superior" WHERE ID_Cliente=5008808') #o comando atualiza a tabela Clientes na coluna Grau_escolaridade para Ensino superior onde na coluna ID_Cliente tiver 5008808

with engine.connect() as conn:
    conn.execute(query)
    conn.commit()

In [65]:
pd.read_sql_table('Clientes', engine).head()

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio
2,5008808,52,Ensino superior,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio
3,5008809,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio
4,5008810,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio